Tekla Open API Reference for Tekla Structures 2025
RebarSplitter.Lapping Property
 Gets or sets the rebar lapping.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarLapping Lapping { get; set; }
Public Property Lapping As RebarLapping
	Get
	Set
Property Value
Type: RebarLapping
See Also
Reference
RebarSplitter Class
Tekla.Structures.Model Namespace